# [LAB-02] Pandas

## #03. DataFrame 자료형

### 라이브러리 참조

In [42]:
from pandas import DataFrame, read_csv, read_excel

In [43]:
# 어느 학급의 성적표를 표현한 2차원 리스트
grade_data = [
                [1, "남자", 98, 77, 88, 64],
                [2, "여자", 88, 90, 62, 72],
                [1, "남자", 92, 70, 83, 79],
                [3, "여자", 63, 60, 31, 70],
                [4, "남자", 75, 50, 90, 88]
            ]
#2차원 리스트를 데이터 프레임으로 변환
# -> 학생별 점수 표현
df = DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  여자  63  60  31  70
4  4  남자  75  50  90  88

In [44]:
#인덱스 이름으로 사용할 리스트
i_names = ['철수', '영희', '민철', '수현', '호영']


# 칼럼 이름으로 사용할 리스트
c_names = ['학년', '성별', '국어', '영어', '수학', '과학']


#인덱스와 칼럼이름 지정하기
df = DataFrame(grade_data, index=i_names, columns=c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [45]:
# 어느 학급의 성적표를 표현한 딕셔너리
grade_dic = {
    '학년': [1,2,1,3,4],
    '성별' : ['남자', '여자', '남자', '여자','남자'],
    '국어' : [98, 88, 92, 63, 75],
    '영어' : [77, 90, 70, 60, 50],
    '수학' : [88, 62, 83, 31, 90],
    '과학' : [64, 72, 79, 70, 88]
}

# 딕셔너리 key가 칼럼(열)이름이 된다.
df = DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

In [46]:
#인덱스 지정하기
df = DataFrame(grade_dic,
               index=['철수', '영희', '민철', '수현', '호영'])

#인덱스 제목 지정하기
df.index.name = '이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [47]:
grade_list = [
    {"이름": "철수", "학년":1, "성별":"남자", "국어":98, "영어":77,
     "수학": 88, "과학":64},
    {"이름": "철수", "학년":2, "성별":"여자", "국어":88, "영어":90,
     "수학": 62, "과학":72},
    {"이름": "철수", "학년":1, "성별":"남자", "국어":92, "영어":70,
     "수학": 83, "과학":79},
     {"이름": "철수", "학년":3, "성별":"여자", "국어":63, "영어":60,
     "수학": 31, "과학":70},
     {"이름": "철수", "학년":4, "성별":"남자", "국어":75, "영어":50,
     "수학": 90, "과학":88}
]

df = DataFrame(grade_list)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  철수   2  여자  88  90  62  72
2  철수   1  남자  92  70  83  79
3  철수   3  여자  63  60  31  70
4  철수   4  남자  75  50  90  88

In [48]:
df2 = df.set_index('이름')
df2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
철수   2  여자  88  90  62  72
철수   1  남자  92  70  83  79
철수   3  여자  63  60  31  70
철수   4  남자  75  50  90  88

In [49]:
df.set_index('이름', inplace=True)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
철수   2  여자  88  90  62  72
철수   1  남자  92  70  83  79
철수   3  여자  63  60  31  70
철수   4  남자  75  50  90  88

In [50]:
df3 = df.reset_index()
df3

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  철수   2  여자  88  90  62  72
2  철수   1  남자  92  70  83  79
3  철수   3  여자  63  60  31  70
4  철수   4  남자  75  50  90  88

In [51]:
df3.reset_index()

   index  이름  학년  성별  국어  영어  수학  과학
0      0  철수   1  남자  98  77  88  64
1      1  철수   2  여자  88  90  62  72
2      2  철수   1  남자  92  70  83  79
3      3  철수   3  여자  63  60  31  70
4      4  철수   4  남자  75  50  90  88

In [52]:
df3.reset_index(drop=True)

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  철수   2  여자  88  90  62  72
2  철수   1  남자  92  70  83  79
3  철수   3  여자  63  60  31  70
4  철수   4  남자  75  50  90  88

In [53]:
df = read_csv("https://data.hossam.kr/data/grade.csv",
              encoding="euc-kr")

df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [54]:
df = read_csv("https://data.hossam.kr/data/grade.csv",
              encoding="euc-kr",
              index_col='이름')
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [58]:
df = read_excel("https://data.hossam.kr/data/grade.xlsx",
                index_col='이름')


df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80